Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2064dak176.h
#define _ADCFLTR2_DFMODE_POSITION                0x0000001D
#define _ADCFLTR2_DFMODE_MASK                    0x20000000
#define _ADCFLTR2_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR2_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR2_DATA16EN_MASK                  0x40000000
#define _ADCFLTR2_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR2_AFEN_POSITION                  0x0000001F
#define _ADCFLTR2_AFEN_MASK                      0x80000000
#define _ADCFLTR2_AFEN_LENGTH                    0x00000001

#define _ADCFLTR3_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR3_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR3_FLTRDATA_LENGTH                0x00000010

#define _ADCFLTR3_CHNLID_POSITION                0x00000010
#define _ADCFLTR3_CHNLID_MASK                    0x001F0000
#define _ADCFLTR3_CHNLID_LENGTH                  0x00000005

#define _ADCFLTR3_AFRDY_POSITION                 0x00000018
#define _ADCFLTR3_AFRDY_MASK                     0x01000000
#define _ADCFLTR3_AFRDY_LENGTH                   0x00000001

#define _ADCFLTR3_AFGIEN_POSITION                0x00000019
#define _ADCFLTR3_AFGIEN_MASK                    0x02000000
#define _ADCFLTR3_AFGIEN_LENGTH                  0x00000001

#define _ADCFLTR3_OVRSAM_POSITION                0x0000001A
#define _ADCFLTR3_OVRSAM_MASK                    0x1C000000
#define _ADCFLTR3_OVRSAM_LENGTH                  0x00000003

#define _ADCFLTR3_DFMODE_POSITION                0x0000001D
#define _ADCFLTR3_DFMODE_MASK                    0x20000000
#define _ADCFLTR3_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR3_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR3_DATA16EN_MASK                  0x40000000
#define _ADCFLTR3_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR3_AFEN_POSITION                  0x0000001F
#define _ADCFLTR3_AFEN_MASK                      0x80000000
#define _ADCFLTR3_AFEN_LENGTH                    0x00000001

#define _ADCFLTR4_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR4_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR4_FLTRDATA_LENGTH                0x00000010

#define _ADCFLTR4_CHNLID_POSITION                0x00000010
#define _ADCFLTR4_CHNLID_MASK                    0x001F0000
#define _ADCFLTR4_CHNLID_LENGTH                  0x00000005

#define _ADCFLTR4_AFRDY_POSITION                 0x00000018
#define _ADCFLTR4_AFRDY_MASK                     0x01000000
#define _ADCFLTR4_AFRDY_LENGTH                   0x00000001

#define _ADCFLTR4_AFGIEN_POSITION                0x00000019
#define _ADCFLTR4_AFGIEN_MASK                    0x02000000
#define _ADCFLTR4_AFGIEN_LENGTH                  0x00000001

#define _ADCFLTR4_OVRSAM_POSITION                0x0000001A
#define _ADCFLTR4_OVRSAM_MASK                    0x1C000000
#define _ADCFLTR4_OVRSAM_LENGTH                  0x00000003

#define _ADCFLTR4_DFMODE_POSITION                0x0000001D
#define _ADCFLTR4_DFMODE_MASK                    0x20000000
#define _ADCFLTR4_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR4_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR4_DATA16EN_MASK                  0x40000000
#define _ADCFLTR4_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR4_AFEN_POSITION                  0x0000001F
#define _ADCFLTR4_AFEN_MASK                      0x80000000
#define _ADCFLTR4_AFEN_LENGTH                    0x00000001

#define _ADCFLTR5_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR5_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR5_FLTRDATA_LENGTH                0x00000010

#define _ADCFLTR5_CHNLID_POSITION                0x00000010
#define _ADCFLTR5_CHNLID_MASK                    0x001F0000
#define _ADCFLTR5_CHNLID_LENGTH                  0x00000005

#define _ADCFLTR5_AFRDY_POSITION                 0x00000018
#define _ADCFLTR5_AFRDY_MASK                     0x01000000
#define _ADCFLTR5_AFRDY_LENGTH                   0x00000001

#define _ADCFLTR5_AFGIEN_POSITION                0x00000019
#define _ADCFLTR5_AFGIEN_MASK                    0x02000000
#define _ADCFLTR5_AFGIEN_LENGTH                  0x00000001

#define _ADCFLTR5_OVRSAM_POSITION                0x0000001A
#define _ADCFLTR5_OVRSAM_MASK                    0x1C000000
#define _ADCFLTR5_OVRSAM_LENGTH                  0x00000003

#define _ADCFLTR5_DFMODE_POSITION                0x0000001D
#define _ADCFLTR5_DFMODE_MASK                    0x20000000
#define _ADCFLTR5_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR5_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR5_DATA16EN_MASK                  0x40000000
#define _ADCFLTR5_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR5_AFEN_POSITION                  0x0000001F
#define _ADCFLTR5_AFEN_MASK                      0x80000000
#define _ADCFLTR5_AFEN_LENGTH                    0x00000001

#define _ADCFLTR6_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR6_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR6_FLTRDATA_LENGTH                0x00000010

#define _ADCFLTR6_CHNLID_POSITION                0x00000010
#define _ADCFLTR6_CHNLID_MASK                    0x001F0000
#define _ADCFLTR6_CHNLID_LENGTH                  0x00000005

#define _ADCFLTR6_AFRDY_POSITION                 0x00000018
#define _ADCFLTR6_AFRDY_MASK                     0x01000000
#define _ADCFLTR6_AFRDY_LENGTH                   0x00000001

#define _ADCFLTR6_AFGIEN_POSITION                0x00000019
#define _ADCFLTR6_AFGIEN_MASK                    0x02000000
#define _ADCFLTR6_AFGIEN_LENGTH                  0x00000001

#define _ADCFLTR6_OVRSAM_POSITION                0x0000001A
#define _ADCFLTR6_OVRSAM_MASK                    0x1C000000
#define _ADCFLTR6_OVRSAM_LENGTH                  0x00000003

#define _ADCFLTR6_DFMODE_POSITION                0x0000001D
#define _ADCFLTR6_DFMODE_MASK                    0x20000000
#define _ADCFLTR6_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR6_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR6_DATA16EN_MASK                  0x40000000
#define _ADCFLTR6_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR6_AFEN_POSITION                  0x0000001F
#define _ADCFLTR6_AFEN_MASK                      0x80000000
#define _ADCFLTR6_AFEN_LENGTH                    0x00000001

#define _ADCTRG1_TRGSRC0_POSITION                0x00000000
#define _ADCTRG1_TRGSRC0_MASK                    0x0000001F
#define _ADCTRG1_TRGSRC0_LENGTH                  0x00000005

#define _ADCTRG1_TRGSRC1_POSITION                0x00000008
#define _ADCTRG1_TRGSRC1_MASK                    0x00001F00
#define _ADCTRG1_TRGSRC1_LENGTH                  0x00000005

#define _ADCTRG1_TRGSRC2_POSITION                0x00000010
#define _ADCTRG1_TRGSRC2_MASK                    0x001F0000
#define _ADCTRG1_TRGSRC2_LENGTH                  0x00000005

