Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2064dak176.h
#define _ADCEIEN1_EIEN6_POSITION                 0x00000006
#define _ADCEIEN1_EIEN6_MASK                     0x00000040
#define _ADCEIEN1_EIEN6_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN7_POSITION                 0x00000007
#define _ADCEIEN1_EIEN7_MASK                     0x00000080
#define _ADCEIEN1_EIEN7_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN8_POSITION                 0x00000008
#define _ADCEIEN1_EIEN8_MASK                     0x00000100
#define _ADCEIEN1_EIEN8_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN9_POSITION                 0x00000009
#define _ADCEIEN1_EIEN9_MASK                     0x00000200
#define _ADCEIEN1_EIEN9_LENGTH                   0x00000001

#define _ADCEIEN1_EIEN10_POSITION                0x0000000A
#define _ADCEIEN1_EIEN10_MASK                    0x00000400
#define _ADCEIEN1_EIEN10_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN11_POSITION                0x0000000B
#define _ADCEIEN1_EIEN11_MASK                    0x00000800
#define _ADCEIEN1_EIEN11_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN12_POSITION                0x0000000C
#define _ADCEIEN1_EIEN12_MASK                    0x00001000
#define _ADCEIEN1_EIEN12_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN13_POSITION                0x0000000D
#define _ADCEIEN1_EIEN13_MASK                    0x00002000
#define _ADCEIEN1_EIEN13_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN14_POSITION                0x0000000E
#define _ADCEIEN1_EIEN14_MASK                    0x00004000
#define _ADCEIEN1_EIEN14_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN15_POSITION                0x0000000F
#define _ADCEIEN1_EIEN15_MASK                    0x00008000
#define _ADCEIEN1_EIEN15_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN16_POSITION                0x00000010
#define _ADCEIEN1_EIEN16_MASK                    0x00010000
#define _ADCEIEN1_EIEN16_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN17_POSITION                0x00000011
#define _ADCEIEN1_EIEN17_MASK                    0x00020000
#define _ADCEIEN1_EIEN17_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN18_POSITION                0x00000012
#define _ADCEIEN1_EIEN18_MASK                    0x00040000
#define _ADCEIEN1_EIEN18_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN19_POSITION                0x00000013
#define _ADCEIEN1_EIEN19_MASK                    0x00080000
#define _ADCEIEN1_EIEN19_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN20_POSITION                0x00000014
#define _ADCEIEN1_EIEN20_MASK                    0x00100000
#define _ADCEIEN1_EIEN20_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN21_POSITION                0x00000015
#define _ADCEIEN1_EIEN21_MASK                    0x00200000
#define _ADCEIEN1_EIEN21_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN22_POSITION                0x00000016
#define _ADCEIEN1_EIEN22_MASK                    0x00400000
#define _ADCEIEN1_EIEN22_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN23_POSITION                0x00000017
#define _ADCEIEN1_EIEN23_MASK                    0x00800000
#define _ADCEIEN1_EIEN23_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN24_POSITION                0x00000018
#define _ADCEIEN1_EIEN24_MASK                    0x01000000
#define _ADCEIEN1_EIEN24_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN25_POSITION                0x00000019
#define _ADCEIEN1_EIEN25_MASK                    0x02000000
#define _ADCEIEN1_EIEN25_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN26_POSITION                0x0000001A
#define _ADCEIEN1_EIEN26_MASK                    0x04000000
#define _ADCEIEN1_EIEN26_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN27_POSITION                0x0000001B
#define _ADCEIEN1_EIEN27_MASK                    0x08000000
#define _ADCEIEN1_EIEN27_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN28_POSITION                0x0000001C
#define _ADCEIEN1_EIEN28_MASK                    0x10000000
#define _ADCEIEN1_EIEN28_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN29_POSITION                0x0000001D
#define _ADCEIEN1_EIEN29_MASK                    0x20000000
#define _ADCEIEN1_EIEN29_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN30_POSITION                0x0000001E
#define _ADCEIEN1_EIEN30_MASK                    0x40000000
#define _ADCEIEN1_EIEN30_LENGTH                  0x00000001

#define _ADCEIEN1_EIEN31_POSITION                0x0000001F
#define _ADCEIEN1_EIEN31_MASK                    0x80000000
#define _ADCEIEN1_EIEN31_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN32_POSITION                0x00000000
#define _ADCEIEN2_EIEN32_MASK                    0x00000001
#define _ADCEIEN2_EIEN32_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN33_POSITION                0x00000001
#define _ADCEIEN2_EIEN33_MASK                    0x00000002
#define _ADCEIEN2_EIEN33_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN34_POSITION                0x00000002
#define _ADCEIEN2_EIEN34_MASK                    0x00000004
#define _ADCEIEN2_EIEN34_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN35_POSITION                0x00000003
#define _ADCEIEN2_EIEN35_MASK                    0x00000008
#define _ADCEIEN2_EIEN35_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN36_POSITION                0x00000004
#define _ADCEIEN2_EIEN36_MASK                    0x00000010
#define _ADCEIEN2_EIEN36_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN37_POSITION                0x00000005
#define _ADCEIEN2_EIEN37_MASK                    0x00000020
#define _ADCEIEN2_EIEN37_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN38_POSITION                0x00000006
#define _ADCEIEN2_EIEN38_MASK                    0x00000040
#define _ADCEIEN2_EIEN38_LENGTH                  0x00000001

#define _ADCEIEN2_EIEN39_POSITION                0x00000007
#define _ADCEIEN2_EIEN39_MASK                    0x00000080
#define _ADCEIEN2_EIEN39_LENGTH                  0x00000001

