Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2064dak176.h
#define _EMAC1MIND_w_POSITION                    0x00000000
#define _EMAC1MIND_w_MASK                        0xFFFFFFFF
#define _EMAC1MIND_w_LENGTH                      0x00000020

#define _EMACxMIND_MIIMBUSY_POSITION             0x00000000
#define _EMACxMIND_MIIMBUSY_MASK                 0x00000001
#define _EMACxMIND_MIIMBUSY_LENGTH               0x00000001

#define _EMACxMIND_SCAN_POSITION                 0x00000001
#define _EMACxMIND_SCAN_MASK                     0x00000002
#define _EMACxMIND_SCAN_LENGTH                   0x00000001

#define _EMACxMIND_NOTVALID_POSITION             0x00000002
#define _EMACxMIND_NOTVALID_MASK                 0x00000004
#define _EMACxMIND_NOTVALID_LENGTH               0x00000001

#define _EMACxMIND_LINKFAIL_POSITION             0x00000003
#define _EMACxMIND_LINKFAIL_MASK                 0x00000008
#define _EMACxMIND_LINKFAIL_LENGTH               0x00000001

#define _EMACxMIND_w_POSITION                    0x00000000
#define _EMACxMIND_w_MASK                        0xFFFFFFFF
#define _EMACxMIND_w_LENGTH                      0x00000020

#define _EMAC1SA0_STNADDR5_POSITION              0x00000000
#define _EMAC1SA0_STNADDR5_MASK                  0x000000FF
#define _EMAC1SA0_STNADDR5_LENGTH                0x00000008

#define _EMAC1SA0_STNADDR6_POSITION              0x00000008
#define _EMAC1SA0_STNADDR6_MASK                  0x0000FF00
#define _EMAC1SA0_STNADDR6_LENGTH                0x00000008

#define _EMAC1SA0_w_POSITION                     0x00000000
#define _EMAC1SA0_w_MASK                         0xFFFFFFFF
#define _EMAC1SA0_w_LENGTH                       0x00000020

#define _EMACxSA0_STNADDR5_POSITION              0x00000000
#define _EMACxSA0_STNADDR5_MASK                  0x000000FF
#define _EMACxSA0_STNADDR5_LENGTH                0x00000008

#define _EMACxSA0_STNADDR6_POSITION              0x00000008
#define _EMACxSA0_STNADDR6_MASK                  0x0000FF00
#define _EMACxSA0_STNADDR6_LENGTH                0x00000008

#define _EMACxSA0_w_POSITION                     0x00000000
#define _EMACxSA0_w_MASK                         0xFFFFFFFF
#define _EMACxSA0_w_LENGTH                       0x00000020

#define _EMAC1SA1_STNADDR3_POSITION              0x00000000
#define _EMAC1SA1_STNADDR3_MASK                  0x000000FF
#define _EMAC1SA1_STNADDR3_LENGTH                0x00000008

#define _EMAC1SA1_STNADDR4_POSITION              0x00000008
#define _EMAC1SA1_STNADDR4_MASK                  0x0000FF00
#define _EMAC1SA1_STNADDR4_LENGTH                0x00000008

#define _EMAC1SA1_w_POSITION                     0x00000000
#define _EMAC1SA1_w_MASK                         0xFFFFFFFF
#define _EMAC1SA1_w_LENGTH                       0x00000020

#define _EMACxSA1_STNADDR3_POSITION              0x00000000
#define _EMACxSA1_STNADDR3_MASK                  0x000000FF
#define _EMACxSA1_STNADDR3_LENGTH                0x00000008

#define _EMACxSA1_STNADDR4_POSITION              0x00000008
#define _EMACxSA1_STNADDR4_MASK                  0x0000FF00
#define _EMACxSA1_STNADDR4_LENGTH                0x00000008

#define _EMACxSA1_w_POSITION                     0x00000000
#define _EMACxSA1_w_MASK                         0xFFFFFFFF
#define _EMACxSA1_w_LENGTH                       0x00000020

#define _EMAC1SA2_STNADDR1_POSITION              0x00000000
#define _EMAC1SA2_STNADDR1_MASK                  0x000000FF
#define _EMAC1SA2_STNADDR1_LENGTH                0x00000008

#define _EMAC1SA2_STNADDR2_POSITION              0x00000008
#define _EMAC1SA2_STNADDR2_MASK                  0x0000FF00
#define _EMAC1SA2_STNADDR2_LENGTH                0x00000008

#define _EMAC1SA2_w_POSITION                     0x00000000
#define _EMAC1SA2_w_MASK                         0xFFFFFFFF
#define _EMAC1SA2_w_LENGTH                       0x00000020

#define _EMACxSA2_STNADDR1_POSITION              0x00000000
#define _EMACxSA2_STNADDR1_MASK                  0x000000FF
#define _EMACxSA2_STNADDR1_LENGTH                0x00000008

#define _EMACxSA2_STNADDR2_POSITION              0x00000008
#define _EMACxSA2_STNADDR2_MASK                  0x0000FF00
#define _EMACxSA2_STNADDR2_LENGTH                0x00000008

#define _EMACxSA2_w_POSITION                     0x00000000
#define _EMACxSA2_w_MASK                         0xFFFFFFFF
#define _EMACxSA2_w_LENGTH                       0x00000020

#define _USBCRCON_USBWKUPEN_POSITION             0x00000000
#define _USBCRCON_USBWKUPEN_MASK                 0x00000001
#define _USBCRCON_USBWKUPEN_LENGTH               0x00000001

#define _USBCRCON_USBRIE_POSITION                0x00000001
#define _USBCRCON_USBRIE_MASK                    0x00000002
#define _USBCRCON_USBRIE_LENGTH                  0x00000001

#define _USBCRCON_USBIE_POSITION                 0x00000002
#define _USBCRCON_USBIE_MASK                     0x00000004
#define _USBCRCON_USBIE_LENGTH                   0x00000001

#define _USBCRCON_SENDMONEN_POSITION             0x00000003
#define _USBCRCON_SENDMONEN_MASK                 0x00000008
#define _USBCRCON_SENDMONEN_LENGTH               0x00000001

#define _USBCRCON_BSVALMONEN_POSITION            0x00000004
#define _USBCRCON_BSVALMONEN_MASK                0x00000010
#define _USBCRCON_BSVALMONEN_LENGTH              0x00000001

#define _USBCRCON_ASVALMONEN_POSITION            0x00000005
#define _USBCRCON_ASVALMONEN_MASK                0x00000020
#define _USBCRCON_ASVALMONEN_LENGTH              0x00000001

#define _USBCRCON_VBUSMONEN_POSITION             0x00000006
#define _USBCRCON_VBUSMONEN_MASK                 0x00000040
#define _USBCRCON_VBUSMONEN_LENGTH               0x00000001

#define _USBCRCON_PHYIDEN_POSITION               0x00000007
#define _USBCRCON_PHYIDEN_MASK                   0x00000080
#define _USBCRCON_PHYIDEN_LENGTH                 0x00000001

#define _USBCRCON_USBIDVAL_POSITION              0x00000008
#define _USBCRCON_USBIDVAL_MASK                  0x00000100
#define _USBCRCON_USBIDVAL_LENGTH                0x00000001

#define _USBCRCON_USBIDOVEN_POSITION             0x00000009
#define _USBCRCON_USBIDOVEN_MASK                 0x00000200
#define _USBCRCON_USBIDOVEN_LENGTH               0x00000001

#define _USBCRCON_USBWKUP_POSITION               0x00000018
#define _USBCRCON_USBWKUP_MASK                   0x01000000
#define _USBCRCON_USBWKUP_LENGTH                 0x00000001

#define _USBCRCON_USBRF_POSITION                 0x00000019
#define _USBCRCON_USBRF_MASK                     0x02000000
#define _USBCRCON_USBRF_LENGTH                   0x00000001

#define _USBCRCON_USBIF_POSITION                 0x0000001A
#define _USBCRCON_USBIF_MASK                     0x04000000
#define _USBCRCON_USBIF_LENGTH                   0x00000001

